# vstSetCursorByView

## Description
Set appropreate cursor according to the view.

```pascal
PROCEDURE vstSetCursorByView;
```

```python
def vs.vstSetCursorByView():
    return None
```

## Examples
```pascal
vstSetCursorByView;
```
```python
import vs

# Set appropreate cursor according to the view.
vs.vstSetCursorByView()
```

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events